// Задача 34: Задайте массив, заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.
// [345, 897, 568, 234] -> 2

int[] arr = createRandomArray(5, 100, 1000);
Console.WriteLine(string.Join(", ", arr));
Console.WriteLine("количество четных чисел: " + countEvenNumbers(arr));

int countEvenNumbers(int[] array)
{
    int result = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i] % 2 == 0)
        {
            result = result + array[i];
        }
    }
    return result;
}

int[] createRandomArray(int size, int leftRange, int rightRange)
{
    int[] array = new int[size];
    Random rand = new Random();
    for (int i = 0; i < size; i++)
    {
        array[i] = rand.Next(leftRange, rightRange);
    }
    return array;
}



